\l ../boson.q

TOKEN:first read0`:.BosonNLP.token

//情感分析/////////////////////////////////////////////////////////////////////

.boson.Sentiment[TOKEN;`;]  ("他是个傻逼";"美好的世界")

.boson.Sentiment[TOKEN;`food;]  ("这家味道还不错";"菜品太少了而且还不新鲜")

asc(S:.boson.Sentiment[TOKEN;`;L])!L:   read0`:text_sentiment.txt
asc(!). flip({("F"$", "vs 1_x 0;"]"sv 1_x)}"]"vs)@/:read0`:result_sentiment.txt

//命名实体识别/////////////////////////////////////////////////////////////////

.boson.NER[TOKEN;0N;]   "成都商报记者 姚永忠"

.boson.NER[TOKEN;0N;]
    "对于该小孩是不是郑尚金的孩子，目前已做亲子鉴定，结果还没出来，",
    "纪检部门仍在调查之中。成都商报记者 姚永忠"

.boson.NER[TOKEN;2;]   ("成都商报记者 姚永忠";"微软XP操作系统今日正式退休")
    
//依存文法分析/////////////////////////////////////////////////////////////////

.boson.DepParser[TOKEN;]    "我以最快的速度吃了午饭"
    
.boson.DepParser[TOKEN;]   ("今天天气好";"美好的世界")

//关键词提取///////////////////////////////////////////////////////////////////

.boson.Keywords[TOKEN; 2;0b;]   "病毒式媒体网站：让新闻迅速蔓延"

.boson.Keywords[TOKEN;10;0b;]   "病毒式媒体网站：让新闻迅速蔓延"

//新闻分类/////////////////////////////////////////////////////////////////////

.boson.Classify[TOKEN;]
    ("俄否决安理会谴责叙军战机空袭阿勒颇平民";"邓紫棋谈男友林宥嘉：我觉得我比他唱得好";"Facebook收购印度初创公司")

//语义联想/////////////////////////////////////////////////////////////////////

.boson.Suggest[TOKEN;0N;]   "粉丝"
  
.boson.Suggest[TOKEN;2 ;]   "北京"

//分词与词性标注///////////////////////////////////////////////////////////////

.boson.Tag[TOKEN;             ()!() ;]  "人民法院案件受理制度改革  下月起法院将有案必立"
.boson.Tag[TOKEN;(1#`space_mode)!1#1;]  "人民法院案件受理制度改革  下月起法院将有案必立"
.boson.Tag[TOKEN;(1#`space_mode)!1#2;]  "人民法院案件受理制度改革  下月起法院将有案必立"

.boson.Tag[TOKEN;(1#`oov_level)!1#0;]   ("亚投行意向创始成员国确定为57个";"流量贵”频被吐槽")
.boson.Tag[TOKEN;(1#`oov_level)!1#1;]   ("亚投行意向创始成员国确定为57个";"流量贵”频被吐槽")
.boson.Tag[TOKEN;            ()!() ;]   ("亚投行意向创始成员国确定为57个";"流量贵”频被吐槽")
.boson.Tag[TOKEN;(1#`oov_level)!1#4;]   ("亚投行意向创始成员国确定为57个";"流量贵”频被吐槽")

.boson.Tag[TOKEN;      ()!()  ;]    "臺灣沿用傳統漢字，稱之為正體字"
.boson.Tag[TOKEN;(1#`t2s)!1#1b;]    "臺灣沿用傳統漢字，稱之為正體字"

.boson.Tag[TOKEN;                    ()!()  ;]  ("亚投行 意向创始成员国确定为57个\n";"“流量贵”频被吐槽\n")
.boson.Tag[TOKEN;(1#`special_char_conv)!1#1b;]  ("亚投行 意向创始成员国确定为57个\n";"“流量贵”频被吐槽\n")

//时间转换/////////////////////////////////////////////////////////////////////

.boson.Time[TOKEN;"2013年二月二十八日下午四点三十分二十九秒";0Nd]

.boson.Time[TOKEN;"今天晚上8点到明天下午3点";2015.09.01]
.boson.Time[TOKEN;"今天晚上8点到明天下午3点";.z.P]

//新闻摘要/////////////////////////////////////////////////////////////////////

.boson.Summary[TOKEN;.2;0b;"";] t:
    "腾讯科技讯（刘亚澜）10月22日消息，",
    "前优酷土豆技术副总裁黄冬已于日前正式加盟芒果TV，出任CTO一职。",
    "资料显示，黄冬历任土豆网技术副总裁、优酷土豆集团产品技术副总裁等职务，",
    "曾主持设计、运营过优酷土豆多个大型高容量产品和系统。",
    "此番加入芒果TV或与芒果TV计划自主研发智能硬件OS有关。",
    "今年3月，芒果TV对外公布其全平台日均独立用户突破3000万，日均VV突破1亿，",
    "但挥之不去的是业内对其技术能力能否匹配发展速度的质疑，",
    "亟须招揽技术人才提升整体技术能力。",
    "芒果TV是国内互联网电视七大牌照方之一，之前采取的是“封闭模式”与硬件厂商预装合作，",
    "而现在是“开放下载”+“厂商预装”。",
    "黄冬在加盟土豆网之前曾是国内FreeBSD（开源OS）社区发起者之一，",
    "是研究并使用开源OS的技术专家，离开优酷土豆集团后其加盟果壳电子，",
    "涉足智能硬件行业，将开源OS与硬件结合，创办魔豆智能路由器。",
    "未来黄冬可能会整合其在开源OS、智能硬件上的经验，结合芒果的牌照及资源优势，",
    "在智能硬件或OS领域发力。",
    "公开信息显示，芒果TV在今年6月对外宣布完成A轮5亿人民币融资，估值70亿。",
    "据芒果TV控股方芒果传媒的消息人士透露，芒果TV即将启动B轮融资。"

.boson.Summary[TOKEN;.3;0b;"";] t

.boson.Summary[TOKEN;200;0b;"";] t

.boson.Summary[TOKEN;.3;1b;"";] t
